Revit 2027 API
SpatialFieldManager.RemoveSpatialFieldPrimitive Method
 Removes analysis results primitive identified by the unique index
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void RemoveSpatialFieldPrimitive(
	int idx
)
Public Sub RemoveSpatialFieldPrimitive (
	idx As Integer
)
public:
void RemoveSpatialFieldPrimitive(
	int idx
)
member RemoveSpatialFieldPrimitive :
        idx : int -> unit
Parameters
idx Int32
 Unique index identifying the primitive
Exceptions
Exception | Condition
ArgumentException |  idx refers to non-existent primitive
See Also
Reference
SpatialFieldManager Class
Autodesk.Revit.DB.Analysis Namespace